       IDENTIFICATION DIVISION.
       PROGRAM-ID. FACTORIAL-CALCULATION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NUMBER PIC 9(3).
       01  FACTORIAL PIC 9(18) VALUE 1.
       01  COUNTER PIC 9(1) VALUE 1.

       PROCEDURE DIVISION.
       DISPLAY "ENTER THE NUMBER TO CALCULATE FACTORIAL"
       ACCEPT WS-NUMBER
       PERFORM CALCULATE-FACTORIAL
       DISPLAY "FACTORIAL OF " WS-NUMBER "IS " FACTORIAL
       STOP RUN.

       CALCULATE-FACTORIAL.
           IF WS-NUMBER = 0
               MOVE 1 TO FACTORIAL
           ELSE
               PERFORM VARYING COUNTER FROM 1 BY 1 UNTIL COUNTER > 
      -         WS-NUMBER
               MULTIPLY COUNTER BY FACTORIAL GIVING FACTORIAL
               END-PERFORM
           END-IF.
           
